{
  "submissions": [
    "Plant drought-tolerant street trees on heat-prone corridors with long-term watering plans.",
    "Convert underused plazas into pocket parks with native plants and pollinator habitats.",
    "Launch a Green Roof grant to support residents and SMEs adding vegetation to rooftops.",
    "Create biodiversity corridors linking parks through tree-lined, flowering streets.",
    "Expand community gardens on vacant plots with shared tools and compost.",
    "Replace decorative lawns with wildflower meadows to boost urban biodiversity.",
    "Build a continuous network of protected bike lanes across Basel's main arteries.",
    "Introduce 30 km/h traffic-calmed neighborhoods near schools and clinics.",
    "Add secure, covered bike parking at tram hubs and dense blocks.",
    "Pilot school streets closed to cars at start and end times.",
    "Improve tram and bus frequency in evenings with real-time info at stops.",
    "Add wayfinding signage for safe walking and cycling greenways.",
    "Create car-free micro-plazas with shade, seating, and water misters in summer.",
    "Install more benches and barrier-free seating along popular walking routes.",
    "Design play streets with modular elements for kids on weekends.",
    "Provide clean, accessible public toilets in busy districts and parks.",
    "Add warm, pedestrian-scale lighting to make evening streets feel safe.",
    "Activate squares with community markets, music, and pop-up libraries.",
    "Roll out separated recycling bins in public spaces with clear signage.",
    "Launch monthly zero-waste markets featuring bulk goods and refill stations.",
    "Support repair cafes teaching residents to fix electronics and bikes.",
    "Add cigarette-butt bins with awareness messaging near tram stops.",
    "Create neighborhood compost hubs linked to community gardens.",
    "Organize quarterly litter clean-up days with local schools and clubs.",
    "Open more safe Rhine access points with ladders and shaded seating.",
    "Naturalize riverbanks where possible to enhance habitat and flood resilience.",
    "Replace asphalt with permeable pavements on side streets to reduce runoff.",
    "Install rain gardens at intersections to capture stormwater and cool streets.",
    "Map and signpost cool routes with shade and fountains for heat waves.",
    "Add drinking water fountains every 300-400 meters on popular routes."
  ]
}

